{"data":{"post":{"id":"8ae77cf5-7166-5e38-8667-da057f8e63c4","html":"<p>Sometimes artists are not very comfortable with interviews and one them is Russian-born Belgium-based artist <a href=\"http://www.olga-gouskova.be/\" title=\"Olga Gouskova\">Olga Gouskova</a>. <strong>She told me she was a better painter than a writer</strong> and in a sense, was probably reluctant to explain her art through words. The good news is I’m not a critic and I just love art in general so I understand her uneasiness. In her <a href=\"http://www.facebook.com/OlgaGouskovaArt\" title=\"Olga Gouskova Facebook\">Facebook profile</a>, she even posted this quote from Pablo Picasso. “As far as I am concerned, a painting speaks for itself. What is the use of giving explanations, when all is said and done? A painter has only one language.”</p>\n<p>But the following interview was in fact, a good overview of <strong>her creative process, her blooming career and why one critic even branded her art as having hints of Botticelli’s</strong>. Her concept of femininity is not a typical take on beauty but as an extension of her own self, of her desires and aspirations. Her portraits of these mysterious, melancholic, sensual women, is a contemporary representation of femininity and sensuality. Although we are almost always bombarded by female images in fashion magazines and tv, <strong>Olga paints these women with a subtlety that reminds us of ages past when a woman’s striking beauty is simply just enough</strong>.</p>\n<p><img src=\"http://res.cloudinary.com/dhyfq3kop/image/upload/v1425126720/OlgaGouskova_BELIEF-self-portrait_expqc8.jpg\" title=\"Belief by Olga Gouskova, Self-portrait © Olga Gouskova\"></p>\n<p><strong>1. How did your love affair with art begin?</strong></p>\n<p>I was born in Russia and grew up in Belarus. At the age of 11 I went to Byelorussian Art College in Minsk. After 7 years of studying I’ve obtained an academic classical art education. Many hours of painting and drawing. From landscape in watercolor to model in oil on canvas. After college, I went to Byelorussian Academy of Arts in Minsk. But I’ve chosen the Design department because I wanted to learn new things and do something different. And for the next 4 years I was busy with all kinds of textile design for interior and cloth.</p>\n<p>During these years I had a lot of good teachers like Ugrinovich Vladimir and Nazarenko Oleg and I’ve met very interesting and talented people. I’m very grateful for this wonderful experience and the possibilities to learn and do so many different things.</p>\n<p><strong>2. It seems that femininity is a central theme in your artwork, tell us why this is important for you?</strong></p>\n<p>My paintings are about feelings and states of mood – about dreams and expectations. And I express it through the female portrait. Sometimes, it feels like I paint a kind of self-portrait from the inside out – the way I feel… the way I am or the way I want to be or will never be… My thoughts about being happy or sad, sensual or extravagant… The mood of the day, of the season, of the moment… of life– all through(out, they are) portraits of women. In every painting, I try to capture part of the mystery of the female personality by combining the beauty of the physical with the intensity of the mental.</p>\n<p><img src=\"http://res.cloudinary.com/dhyfq3kop/image/upload/v1425126719/Olga-Gouskova_Incognito-II_r1hcux.jpg\" title=\"Incognito II by Olga Gouskova © Olga Gouskova\"></p>\n<p><strong>3. The subjects in your paintings all look sensual and beautiful. What is your concept of beauty? Who are these models?</strong></p>\n<p>Dostoevsky said “Beauty Will Save the World.” Most people say that beauty is in the eyes of the beholder but everyone has his own concept and definition of beauty. My concept of Beauty are my paintings. This is just the way I see and experience it. There’s an unmistakable sense that something important is needing to be expressed and it is effortless to find one’s self responding emotively in return. Perhaps it is a sense that you are viewing something of my unique perspective, shaped by everything that has challenged me, or carried me, hurt me or given me joy…all that has lent itself to the creation of the works of quiet, haunting beauty that are so completely mine.</p>\n<p>There are no particular model. In my paintings, you can clearly recognize the representation of a person. Yet, this is not the main motive of the painting. It is the imagery concept. The portrait merely serves as reason to make the painting. It is not an exact copy of reality, but instead a visual impression of it.</p>\n<p><img src=\"http://res.cloudinary.com/dhyfq3kop/image/upload/v1425126718/OlgaGouskova_Pansies_pvbkfn.jpg\" title=\"Pansies by Olga Gouskova © Olga Gouskova\"></p>\n<p><strong>4. What is your creative process? What materials attract you?</strong></p>\n<p>I use two different techniques. I draw the body with sepia pencil to make it look almost real – warm and soft, giving it a feeling of physical intensity and a subtleness of form, outline and volume. For the rest of each painting I use acrylic and all kinds of pens to draw lines and small decorative details. I don’t paint the volume, using instead flat washes of color. The lines and patterns make the composition dynamic and complete. I like this combination of drawn and painted, color and monochrome in my artworks.</p>\n<p><strong>5. How would you define your visual language?</strong></p>\n<p>Visually and conceptually, I seek a careful balance between clarity and ambiguity in order to capture feelings which are universal yet undefined. With an emphasis on abstract aesthetics over narrative context, the female figures I create function almost as design elements themselves, evoking emotion without defining it – and encouraging the viewer to approach each painting within the framework of his or her unique experiences and memories.</p>\n<p><img src=\"http://res.cloudinary.com/dhyfq3kop/image/upload/v1425126717/OlgaGouskova_Lost_uxxsej.jpg\" title=\"Lost by Olga Gouskova © Olga Gouskova\"></p>\n<p><strong>6. Figurative painting has always been pronounced dead in the media. Why do you think it is still relevant in contemporary art?</strong></p>\n<p>I don’t think any style can really die, as there are always going to be people who enjoy it, even if its not “popular”. Figurative painting could never die. It’s a classic style that everyone can recognize and appreciate around the world. It simply hasn’t been practiced nearly as much as it had in the past because of newer more modern art. There is no opposition between different types of art – the problem is purely one of politics in the media and in the art world.</p>\n<p><strong>7. Would you make a self-portrait in these guises?</strong></p>\n<p>Actually I have one. I’ve created it last year. It calls “Belief”. It’s about believing in myself, in who I am and what I do.</p>\n<p><img src=\"http://res.cloudinary.com/dhyfq3kop/image/upload/v1425126716/OlgaGouskova_Eden_m5m7c6.jpg\" title=\"Eden by Olga Gouskova © Olga Gouskova\"></p>\n<p><strong>8. How much of your Russian upbringing is part of your art? What elements of this culture do you bring to your art?</strong></p>\n<p>I don’t have any intentions to bring something from Russian culture to my paintings. But probably I do it unconsciously anyway. Because some people say that they can see that I’m a Russian artist, that my paintings are very Russian. Even that the faces of my ladies are very Russian. But I don’t see it myself. On the other hand, a lot of Russian artists found my art very European.</p>\n<p>In fact, the question about my nationality is a little bit complicated. I was born n Russia. And my parents come originally from Russia. They graduated [from] Moscow Bauman University. I was 2 years old when we moved to Belarus. I grew up in Belarus. I’ve graduated from the Belorussian Lyceum and Academy of Art. Can you call me for this reason a Belorussian artist? And also I’ve never exhibit in Russia of Belarus. I live 15 years in Belgium. Here in Europe there are much more people who know, love and own my art than in Russia and Belarus. Do I feel myself as a Belgian artist? No, of cause not. And nobody sees me here as a  Belgian artist. For most of the people I’m [a] Russian artist. So I’m Russian-born, Belarus-raised and Belgium-based… Or something like that…</p>\n<p><img src=\"http://res.cloudinary.com/dhyfq3kop/image/upload/v1425126715/OlgaGouskova_White-Orchids_wwyk63.jpg\" title=\"White Orchids by Olga Gouskova © Olga Gouskova\"></p>\n<p><strong>9. Tell us your thoughts about being an artist in Belgium? a young artist? any advice to aspiring artists in general?</strong></p>\n<p>My art career started in Belgium. I did my best to get exposed and [get] attention from art lovers and art collectors. I do it by myself- slowly but surely. And I do help with some advise [to] other artists when I can. I think the most important thing is believing in what you do and staying who you are. Your art should bring you joy and excitement. The rest follows. And every artist is different and has his own path, his own destiny, his own way to success and recognition.</p>\n<p><strong>10. Do you believe in traditional art education?</strong></p>\n<p>Personally, I’ve gained a lot from having traditional art education. Knowing the basics of art is definitely something you should know especially if you’re thinking of making a living out of it. But it doesn’t mean that I think that every artist should have it. You can be a great extraordinary artist without it.</p>\n<p><img src=\"http://res.cloudinary.com/dhyfq3kop/image/upload/v1425126714/OlgaGouskova_Thinking-of-You_ww4hch.jpg\" title=\"Thinking of You by Olga Gouskova © Olga Gouskova\"></p>\n<p><strong>11. Will you ever invite me for coffee or in one of your future exhibits? =)</strong></p>\n<p>Of course. You can come to Brussels at the end of October. I participate in <a href=\"http://www.accessibleartfair.com/\" title=\"Accessible Art Fair\">Accessible Art Fair</a>. It will take place between 28-30 October 2011 in the prestigious setting of the Conrad Hotel.</p>\n<p><img src=\"http://res.cloudinary.com/dhyfq3kop/image/upload/v1425126712/OlgaGouskova_Incognito-III_ja3juj.jpg\" title=\"Incognito III by Olga Gouskova © Olga Gouskova\"></p>","fields":{"slug":"/interview-olga-gouskova-talks-about/","prefix":"2 October 2011"},"frontmatter":{"title":"Interview: Olga Gouskova Talks about the Female Form","category":"interviews","cover":{"childImageSharp":{"resize":{"src":"/static/Olga-Gouskova_Incognito-II_r1hcux-29e639ca23fae31fdbf98edeb7520216-d927d.jpg"}}}}},"authornote":{"id":"b6415c02-57f6-5889-8910-a05deb06efca","html":"<p>Article by <strong>Tuesday Gutierrez</strong>. Former digital marketing manager for the London 2012 Festival, the largest UK festival ever staged. This is her blog about contemporary art, design, film, photography and all that move her soul.</p>"}},"pageContext":{"slug":"/interview-olga-gouskova-talks-about/","prev":{"id":"aee0e36c-a89b-5a0e-b648-f742ecef3887","fields":{"slug":"/kafkas-metamorphosis-at-the-royal-opera-house/","prefix":"28 September 2011","source":"posts"},"frontmatter":{"title":"Kafka's Metamorphosis at the Royal Opera House","category":"theatre"}},"next":{"id":"c067d5d7-6c24-5f69-9fe9-05aac33faf2e","fields":{"slug":"/see-the-indonesian-eye-on-its-last-week/","prefix":"4 October 2011","source":"posts"},"frontmatter":{"title":"See the Indonesian Eye on its Last Week at the Saatchi","category":"exhibits"}},"source":"posts"}}