{"data":{"page":{"id":"b80c14b5-e1c1-5e08-a4d7-e834e5e84c27","html":"<p><img src=\"../../pages/3--work/images/unilever-people.jpg\"></p>\n<h2>Global People and Content Advisor</h2>\n<p>As companies pull out all stops to beat competition, building your employer brand has never been more important than now. The war for talent is fierce, and hiring and retaining talented employees is essential to any company’s success.</p>\n<p><em>LinkedIn Pulse Blogs</em></p>\n<p>My role as Global People and Content Advisor for Unilever was to help strengthen the employer brand by giving a voice to the employees. Employees represent the company and are considered its true brand ambassadors. We empowered them by encouraging them to share their own stories and success.</p>\n<p>As the editorial lead, I managed the whole content process and helped create a calendar with editorial themes to support the employer brand strategy. Coordinating with HR teams across the world (North Asia, Middle East, Europe, North America etc.), I helped identify and tap employees (of different career levels) to share their stories.</p>\n<p>More than 100 blogs have been produced on LinkedIn Pulse over the course of 11 months that fundamentally focus on the following themes: employees’ career journey, work flexibility, working mothers, women in IT, graduate programme, career advice from top hires, as well as some of the company’s important pillars such as sustainability and innovation. LinkedIn was a platform of choice for this project due to its wide network of almost 500M people.</p>\n<p>These stories were shared in employee LInkedIn Profiles and then shared widely on Unilever’s LinkedIn followers of more than 2M as well as in Unilever’s global career site.</p>\n<p>Sustainability was a common thread in people’s stories, proving that this is being deeply ingrained in the culture of the company. As Unilever positions itself as a leader in sustainable business, every employee, no matter in which role they are, is contributing to the sustainable ambition of the company.</p>\n<p><em>Global Careers Site</em></p>\n<p>The employer brand team also spearheaded the restructure of the global careers site. Revamping the format of the site as well as providing fresh content was an important step for the integrated employer brand strategy.</p>\n<p>The aim was to help potential candidates navigate the site easily, help them find what they are looking for, encourage them to apply for roles and make the application process seamless.</p>\n<p>To make this vision a reality, our team had to create a core working group with the global web team, the IT team and two external agencies over the course of a year. The global web team managed the agency for the technical build and our team managed the other agency  for content production. The IT team however managed the improvement of the application system which was another technical project.</p>\n<p>All in all there were three projects for the whole revamp: technical build, content production, technical improvement of the application site.</p>\n<p>Together with the Employer brand director, I was the main contact person for the different parts of the project. My main responsibility however was to manage agency relationship and coordinate with different functions within Unilever to ensure that the content created had been approved by different communication teams and that the messaging was consistent to the overall employer brand proposition.</p>\n<p>\n  <figure class=\"gatsby-resp-image-figure\" style=\"\">\n  \n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/2million-followers-df7fe8c242fe9f3640ecff6a93e5118c-55fd7.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block; null; max-width: 640px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 100%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAUABQDASIAAhEBAxEB/8QAGQABAAIDAAAAAAAAAAAAAAAAAAIEAQMF/8QAFwEBAQEBAAAAAAAAAAAAAAAAAgMAAf/aAAwDAQACEAMQAAABguRQrOs5SGDT3AP/xAAcEAEAAgIDAQAAAAAAAAAAAAABAgMAEgQTITH/2gAIAQEAAQUC+28qIQoqGDXEl1mamMCToYeH/8QAGREAAgMBAAAAAAAAAAAAAAAAAAECEBEx/9oACAEDAQE/AeDlIxbX/8QAFhEBAQEAAAAAAAAAAAAAAAAAABEQ/9oACAECAQE/AVXP/8QAHRAAAgIBBQAAAAAAAAAAAAAAAAEQEQIhIjFBYf/aAAgBAQAGPwKmJpcMvI9o3aqLZ3H/xAAdEAEAAwABBQAAAAAAAAAAAAABABExIRBBUYGh/9oACAEBAAE/IU8Y7FsZTFivEaAd65bw0PnS5iWZTL7u3uCgMJ//2gAMAwEAAgADAAAAECAAwv/EABcRAQEBAQAAAAAAAAAAAAAAAAEAEXH/2gAIAQMBAT8QHXJTuyi0i//EABgRAAMBAQAAAAAAAAAAAAAAAAABERBh/9oACAECAQE/EG+EFTP/xAAeEAEBAAMAAQUAAAAAAAAAAAABEQAhMZFBUWFxgf/aAAgBAQABPxDZUeQPPvuF8I9WD2/sxEVNr21jQhobPxhWogT0RsuDh3zgYuNITxmiYWxe8PkiFc//2Q=='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px transparent;\"\n        alt=\"2million followers\"\n        title=\"We reached 2 million LinkedIn followers for Unilever\"\n        src=\"/static/2million-followers-df7fe8c242fe9f3640ecff6a93e5118c-55fd7.jpg\"\n        srcset=\"/static/2million-followers-df7fe8c242fe9f3640ecff6a93e5118c-e81c0.jpg 200w,\n/static/2million-followers-df7fe8c242fe9f3640ecff6a93e5118c-8e8ea.jpg 400w,\n/static/2million-followers-df7fe8c242fe9f3640ecff6a93e5118c-55fd7.jpg 640w\"\n        sizes=\"(max-width: 640px) 100vw, 640px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    \n  <figcaption class=\"gatsby-resp-image-figcaption\">We reached 2 million LinkedIn followers for Unilever</figcaption>\n  </figure>\n      </p>","frontmatter":{"title":"Unilever"}}},"pageContext":{"slug":"work//unilever-people/","source":"work"}}